# 1) ჩანაწერი ნახეთ ხელახლა, დააკვირდით კარგად კაჰუტის შეკითხვებს,ამოიწერეთ ყველა კითხვა და კომენტარის სახით აღწერეთ ყველაფერი, ბევრი ივარჯიშეთ

# 1. 
print("heloo world")

# პასუხწი - heloo world

# 2.
print(True > False)

# პასუხი - true 

# 3

# რითი ვქმნით კომენტარს პითონში?

# პასუხი - "#"

# 4

x = 15 
y = 4 
print(x // y)

# პასუხი - 3

# 5 

x = 10 
y = 4
print(x / y)

# პასუხი - 2.5


# 6

x = 10 
y = "20"
print(x + y)

# პასუხი - Error 

# 7 

x = 5 
y = 2

print(x ** y)

# პასუხი - 25

# 8

if "მუშაობს else  გარეშ"

# პასუხი - true

# 9

"რითი მთავრდება for loop"

# პასუხი - break

# 10

"რა წიქნება თუ 10 % 3"  

# პასუხი - 1

# 11 

"integer მრავლდება stringze"

# პასუხი - true

# 12

print(3 > 4 or  3 < 5 and 500 < 400 or 320 > 244)

# პასუხი - true

# 13

"რა არის სია list"

# პასუხი - Array

# 14  

"რა არის ალქგორითმი" 

# პასუხი - მოქმედების ნაბიჯ-ნაბიჯ შესრულება <3

# 15

"პითონი გვეწია თუ კუდი?"

# პასუხი - კუდი 

# 16

"დავითი უსმენს როკის სტილის მუსიკას"

# პასუხი - ture 


# 17

"ბატონი გაბრიელიო არ უსმენს მამა პაპურულ ქართულ მუსიკებს?"

# პასუხი - false 

# 18

"გაკვეთილი ჩატარდა კანფეტივით" 

# პასუხი - true 

# 19 

"რომელი ხინკალი ჯობია"

# პასუხი - ფასანაურული


