# შექმენით თავდაპირველა ცარიელი სია, შემდეგ ამ სიაში დაამაეთ 7 ელემენტი, ისევ ამ სიაში მესამე ინდექსზე მდგომ ელემენტს და მეორე ინდექსზე მდგომ ელემენტს შეუცვლით ადგილებს,  მეოთხე ინდექსზე დაამატებთ ახალ დიდი რიცხვს, ასევე მეხუთე ინდექსზე მდგომ ელემენტს და პირველივე ელემენტს ამოშლით სიიდან და დაბეჭდავთ განახლებულ სიას 

my_list = []

my_list.extend([10, 20, 30, 40, 50, 60, 70])

print("მოუთმენელი სია:", my_list)


my_list[2], my_list[1] = my_list[1], my_list[2]


my_list.insert(4, 1000)


del my_list[5]
del my_list[0] 


print("განახლებული სია:", my_list)

# საკლასო დავალაბა: მომხმარებელს უნდა შემოვატანინოთ რიცხვი ეს რიცხვი შეიძლება იყოს დადებითი ან უარყოფითი თუ დადებითს შემოიტანს მომხმარებლის მიერ შემოტანილი დადებით რიცხვს შემოატრიალებს და გახდის -(თქვენი რიცხვი)  ზუსტად ასე უარყოფითზე ოღონდ უარყოფითს გახდის დადებითს


number = float(input("შეიყვანეთ რიცხვი: "))

if number > 0:
    result = -number
elif number < 0:
    result = -number
else:
    result = number
    
print("შეცვლილი რიცხვი:", result)
