# შექმენი ფუნქცია, რომელიც შემოატანინებს მომხმარებელს რიცხვის და დაუმატებს მას 1-ს.

def add_one(number):
    return number + 1


# შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს რიცვს და დააბრუნებს "მაგარია!", თუ რიცხვი 10-ზე მეტია.

def check_number(number):
    if number > 10:
        return "მაგარია!"
    else:
        return "არ არის მაგარია!"


#  შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს ორ ციფრს და დააბრუნებს მათ შორის უმცირესს.

def min_of_two():
    number1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
    number2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
    return min(number1, number2)


# შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს ტექსტს და დააბრუნებს ტექსტის სიგრძეს.

def text_length():
    text = input("შეიყვანეთ ტექსტი: ")
    return len(text)

#  შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს ორ რიცხვს და დააბრუნებს მათ ჯამს.

def sum_of_two():
    number1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
    number2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
    return number1 + number2
# შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს და თუ ის დადებითი იქნება, დააბრუნებს "დადებითი", და თუ უარყოფითი იქნება, "უარყოფითი".

def positive_or_negative():
    number = int(input("შეიყვანეთ რიცხვი: "))
    if number > 0:
        return "დადებითი"
    elif number < 0:
        return "უარყოფითი"
    else:
        return "ნულოვანი"

# შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს რიცხვს და დააბრუნებს True, თუ ის ლუწია  და False, თუ არა.

def is_even():
    number = int(input("შეიყვანეთ რიცხვი: "))
    return number % 2 == 0

# შექმენი ფუნქცია, რომელიც შემოატანინებს მომხარებელს ორ რიცხვს და დააბრუნებს მათ ჯამს დამატებული 5.

def sum_plus_five():
    number1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
    number2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
    return number1 + number2 + 5
